#!/usr/bin/env python3.6
# -*- coding:UTF-8 -*-
u"""tarot.py

Copyright (c) 2019, Yukio Kuro
All rights reserved.

タロットモジュール。
タロット番号と名前、カードの概要、カードの向きと意味を表示する。
"""


def __tarot():
    u"""タロット占術関数。
    タロットカード文字列を取得。
    """
    import functools as __functools
    import random as __random

    arcanum = ((
        u"愚者", u"夢想#愚行#極端#熱狂", (
            u"自由#型破り#無邪気#純粋#天真爛漫#可能性#発想力#天才",
            u"軽率#わがまま#落ちこぼれ#焦り#意気消沈")), (
        u"魔術師", u"意思#手腕#外交", (
            u"起源#可能性#機会#才能#感覚#創造",
            u"混迷#無気力#低迷#裏切り#空回り#消極性")), (
        u"女教皇", u"秘密#神秘#英知", (
            u"直感#知性#安心#満足#期待#聡明#雰囲気",
            u"悲観#無気力#無神経#現実逃避#疑心暗鬼")), (
        u"女帝", u"結実#行動#月日の長さ#未知", (
            u"繁栄#豊穣#母権#愛情#情熱#豊満#包容力#女性的#家庭",
            u"挫折#軽率#虚栄心#嫉妬#感情的#浪費#不安定#怠惰")), (
        u"皇帝", u"統治#堅固#防衛#同盟", (
            u"支配#安定#成就#達成#男性的#権威#行動#意思#責任",
            u"未熟#横暴#傲岸不遜#傲慢#自分勝手#独断#意思薄弱#無責任")), (
        u"教皇", u"信条#社会性#恵み#有徳", (
            u"慈悲#連帯#協調性#信頼#尊敬#優しさ#思いやり#自信#法令#規律の尊守",
            u"守旧制#束縛#躊躇#不信感#独善#逃避#虚栄#怠惰#お節介")), (
        u"恋人", u"魅力#愛#美", (
            u"誘惑と戦う#自分への信頼#価値観の確立#情熱#共感#選択#絆#結婚",
            u"誘惑#不道徳#失恋#空回り#無視#集中力欠如#空虚#離婚")), (
        u"戦車", u"援軍#摂理#勝利#復讐", (
            u"勝利#征服#援軍#行動#成功#積極性#突進力#開拓精神#独立#開放#質実剛健#闘争心#展望#優勢",
            u"暴走#不注意#自分勝手#失敗#傍若無人#焦燥#挫折#視野狭窄#好戦的#劣勢")), (
        u"力", u"勇気#寛大#名誉", (
            u"強大#強固な意思#不撓不屈#理性#自制#実行力#知恵#勇気#冷静#持久戦#潜在能力",
            u"甘え#引っ込み思案#無気力#人任せ#優柔不断#権威を振りかざす")), (
        u"隠者", u"深慮#忠告#崩壊", (
            u"経験則#高尚な助言#秘匿#精神#慎重#優等感#思慮#思いやり#神出鬼没#変幻自在",
            u"閉鎖性#陰湿#消極的#無計画#誤解#悲観的#邪推#劣等感")), (
        u"運命の輪", u"幸運#転機#向上", (
            u"転換点#幸運の到来#機会#変化#結果#出会い#解決#宿命",
            u"情勢の急激な悪化#別れ#すれ違い#降格#災難")), (
        u"正義", (u"平等#正しさ#行政#正当な判決"), (
            u"公正#公平#善行#均衡#誠意#善意#両立",
            u"不正#不公平#偏向#不均衡#一方通行#裁かれる")), (
        u"吊された男", u"英知#慎重#試練#直感", (
            u"修行#忍耐#奉仕#努力#試練#着実#抑制#妥協",
            u"徒労#痩せ我慢#自暴自棄#欲望に負ける")), (
        u"死神", u"停止#損失#死と再生", (
            u"停止#終末#破滅#離散#終局#清算#決着#死の予兆#終焉#消滅#全滅#満身創痍#ゲームオーバー#バッドエンド#死屍累々#"
            u"風前の灯",
            u"再始動#新展開#上昇#挫折から立ち直る#再生#起死回生#名誉挽回#コンティニュー")), (
        u"節制", u"調整#中庸#倹約#管理", (
            u"調和#自制#節度#献身",
            u"浪費#消耗#生活の乱れ")), (
        u"悪魔", u"暴力#激烈#宿命#黒魔術", (
            u"裏切り#拘束#堕落#束縛#誘惑#悪循環#嗜虐的#破天荒#憎悪#嫉妬#恨み#憤怒#破滅",
            u"回復#覚醒#出会い#リセット#生真面目")), (
        u"塔", u"悲観#災難#不名誉#転落", (
            u"崩壊#災害#悲劇#惨事#戦意喪失#記憶喪失#被害妄想#踏んだり蹴ったり#自己破産#精神病#風前の灯#意識過剰#過剰反応",
            u"緊迫#アクシデント#誤解#不幸#無念#屈辱#天変地異")), (
        u"星", u"希望#明るい未来#瞑想#霊感#放棄", (
            u"希望#ひらめき#願いが叶う",
            u"失望#絶望#無気力#高望み#見損ない")), (
        u"月", u"隠された敵#幻想#欺瞞#失敗", (
            u"不安定#幻惑#現実逃避#潜在する危険#欺瞞#幻滅#猶予ない選択#踏んだり蹴ったり#洗脳#トラウマ#フラッシュバック",
            u"失敗にならない過ち#過去からの脱却#徐々に好転#漠然とした未来への展望#優れた直感")), (
        u"太陽", u"物質的な幸福#幸運な結婚#満足", (
            u"成功#誕生#約束された将来",
            u"不調#落胆#衰退#堕胎#流産")), (
        u"審判", u"復活#位置の変化#更新#結果", (
            u"復活#結果#改善#覚醒#発展#敗者復活",
            u"悔恨#行き詰まり#悪い報せ#再起不能")), (
        u"世界", u"完成#約束された成功#旅", (
            u"成就#完成#完全#総合#完遂#完璧#優勝#コングラチュレーション#グッドエンド#完全制覇#正確無比#永遠不滅",
            u"衰退#堕落#未完成#臨界点#調和の崩壊")))
    number = __random.randint(0, 21)
    name, overview, meaning = arcanum[number]
    is_reverse = bool(__random.getrandbits(1))
    return (
        u"{number}: {name}の{position}\n"
        u"概要: {overview}\n"
        u"{position}の意味: {meaning}".format(
            number=number, name=name,
            position=(u"正位置", u"逆位置")[is_reverse],
            overview=__functools.reduce(
                lambda x, y: x+", "+y, overview.split("#")),
            meaning=__functools.reduce(
                lambda x, y: x+", "+y, meaning[is_reverse].split("#"))))


if __name__ == '__main__':
    print (__tarot())
