#!/usr/bin/env python3.6
# -*- coding:UTF-8 -*-
"""tarot.py

Copyright (c) 2019, Yukio Kuro
All rights reserved.

タロットモジュール。
タロット番号と名前、カードの概要、カードの向きと意味を表示する。
"""


def __tarot():
    """タロット占術関数。
    タロットカード文字列を取得。
    """
    import functools as __functools
    import random as __random

    arcanum = ((
        "愚者", "夢想#愚行#極端#熱狂", (
            "自由#型破り#無邪気#純粋#天真爛漫#可能性#発想力#天才",
            "軽率#わがまま#落ちこぼれ#焦り#意気消沈")), (
        "魔術師", "意思#手腕#外交", (
            "起源#可能性#機会#才能#感覚#創造",
            "混迷#無気力#低迷#裏切り#空回り#消極性")), (
        "女教皇", "秘密#神秘#英知", (
            "直感#知性#安心#満足#期待#聡明#雰囲気",
            "悲観#無気力#無神経#現実逃避#疑心暗鬼")), (
        "女帝", "結実#行動#月日の長さ#未知", (
            "繁栄#豊穣#母権#愛情#情熱#豊満#包容力#女性的#家庭",
            "挫折#軽率#虚栄心#嫉妬#感情的#浪費#不安定#怠惰")), (
        "皇帝", "統治#堅固#防衛#同盟", (
            "支配#安定#成就#達成#男性的#権威#行動#意思#責任",
            "未熟#横暴#傲岸不遜#傲慢#自分勝手#独断#意思薄弱#無責任")), (
        "教皇", "信条#社会性#恵み#有徳", (
            "慈悲#連帯#協調性#信頼#尊敬#優しさ#思いやり#自信#法令#規律の尊守",
            "守旧制#束縛#躊躇#不信感#独善#逃避#虚栄#怠惰#お節介")), (
        "恋人", "魅力#愛#美", (
            "誘惑と戦う#自分への信頼#価値観の確立#情熱#共感#選択#絆#結婚",
            "誘惑#不道徳#失恋#空回り#無視#集中力欠如#空虚#離婚")), (
        "戦車", "援軍#摂理#勝利#復讐", (
            "勝利#征服#援軍#行動#成功#積極性#突進力#開拓精神#独立#開放#質実剛健#闘争心#展望#優勢",
            "暴走#不注意#自分勝手#失敗#傍若無人#焦燥#挫折#視野狭窄#好戦的#劣勢")), (
        "力", "勇気#寛大#名誉", (
            "強大#強固な意思#不撓不屈#理性#自制#実行力#知恵#勇気#冷静#持久戦#潜在能力",
            "甘え#引っ込み思案#無気力#人任せ#優柔不断#権威を振りかざす")), (
        "隠者", "深慮#忠告#崩壊", (
            "経験則#高尚な助言#秘匿#精神#慎重#優等感#思慮#思いやり#神出鬼没#変幻自在",
            "閉鎖性#陰湿#消極的#無計画#誤解#悲観的#邪推#劣等感")), (
        "運命の輪", "幸運#転機#向上", (
            "転換点#幸運の到来#機会#変化#結果#出会い#解決#宿命",
            "情勢の急激な悪化#別れ#すれ違い#降格#災難")), (
        "正義", ("平等#正しさ#行政#正当な判決"), (
            "公正#公平#善行#均衡#誠意#善意#両立",
            "不正#不公平#偏向#不均衡#一方通行#裁かれる")), (
        "吊された男", "英知#慎重#試練#直感", (
            "修行#忍耐#奉仕#努力#試練#着実#抑制#妥協",
            "徒労#痩せ我慢#自暴自棄#欲望に負ける")), (
        "死神", "停止#損失#死と再生", (
            "停止#終末#破滅#離散#終局#清算#決着#死の予兆#終焉#消滅#全滅#満身創痍#ゲームオーバー#バッドエンド#死屍累々#"
            "風前の灯",
            "再始動#新展開#上昇#挫折から立ち直る#再生#起死回生#名誉挽回#コンティニュー")), (
        "節制", "調整#中庸#倹約#管理", (
            "調和#自制#節度#献身",
            "浪費#消耗#生活の乱れ")), (
        "悪魔", "暴力#激烈#宿命#黒魔術", (
            "裏切り#拘束#堕落#束縛#誘惑#悪循環#嗜虐的#破天荒#憎悪#嫉妬#恨み#憤怒#破滅",
            "回復#覚醒#出会い#リセット#生真面目")), (
        "塔", "悲観#災難#不名誉#転落", (
            "崩壊#災害#悲劇#惨事#戦意喪失#記憶喪失#被害妄想#踏んだり蹴ったり#自己破産#精神病#風前の灯#意識過剰#過剰反応",
            "緊迫#アクシデント#誤解#不幸#無念#屈辱#天変地異")), (
        "星", "希望#明るい未来#瞑想#霊感#放棄", (
            "希望#ひらめき#願いが叶う",
            "失望#絶望#無気力#高望み#見損ない")), (
        "月", "隠された敵#幻想#欺瞞#失敗", (
            "不安定#幻惑#現実逃避#潜在する危険#欺瞞#幻滅#猶予ない選択#踏んだり蹴ったり#洗脳#トラウマ#フラッシュバック",
            "失敗にならない過ち#過去からの脱却#徐々に好転#漠然とした未来への展望#優れた直感")), (
        "太陽", "物質的な幸福#幸運な結婚#満足", (
            "成功#誕生#約束された将来",
            "不調#落胆#衰退#堕胎#流産")), (
        "審判", "復活#位置の変化#更新#結果", (
            "復活#結果#改善#覚醒#発展#敗者復活",
            "悔恨#行き詰まり#悪い報せ#再起不能")), (
        "世界", "完成#約束された成功#旅", (
            "成就#完成#完全#総合#完遂#完璧#優勝#コングラチュレーション#グッドエンド#完全制覇#正確無比#永遠不滅",
            "衰退#堕落#未完成#臨界点#調和の崩壊")))
    number = __random.randint(0, 21)
    name, overview, meaning = arcanum[number]
    is_reverse = bool(__random.getrandbits(1))
    return (
        "{number}: {name}の{position}\n"
        "概要: {overview}\n"
        "{position}の意味: {meaning}".format(
            number=number, name=name,
            position=("正位置", "逆位置")[is_reverse],
            overview=__functools.reduce(
                lambda x, y: x+", "+y, overview.split("#")),
            meaning=__functools.reduce(
                lambda x, y: x+", "+y, meaning[is_reverse].split("#"))))


if __name__ == '__main__':
    print (__tarot())
